snlkuharlocal/src/DataProcessors/ФормированиеМакетовЭтикеток/ФормированиеМакетовЭтикеток.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеМакетовЭтикеток</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>Префикс</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаРедактирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККоннектору</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияНашейКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ТипыКоробов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ФР_Коллекции</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.РайоныДоставки</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Коллекции</types>
    <types>CatalogRef.ФР_ПоловозрастныеПризнаки</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    <types>CatalogRef.ОтсрочкиПлатежа</types>
    <types>EnumRef.ПериодичностьОтчетов</types>
    <types>CatalogRef.ТипыЦен</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.ТипыСкидок</types>
    <types>CatalogRef.Цвета</types>
    <types>CatalogRef.Размеры</types>
    <types>CatalogRef.Автомобили</types>
    <types>String</types>
    <types>EnumRef.СостояниеДокументов</types>
    <types>CatalogRef.Регионы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.ПричиныРекламаций</types>
    <types>Date</types>
    <types>CatalogRef.ФР_Бренды</types>
    <types>Number</types>
    <types>EnumRef.ПланФакт</types>
    <types>EnumRef.СостоянияОтчетов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ФР_НоменклатурныеГруппы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.АналитикаОтчетов</types>
    <types>CatalogRef.ИБ</types>
    <types>CatalogRef.ВидыОтчетов</types>
    <numberQualifiers>
      <precision>19</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидПланаПродаж</name>
      <description>Вид плана продаж</description>
      <code>00109</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения</name>
      <description>Вид распределения</description>
      <code>00111</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения2</name>
      <description>Вид распределения 2</description>
      <code>00217</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейСверки</name>
      <description>Дата последней сверки</description>
      <code>00215</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>КонтрольЛимитаЗадолженности</name>
      <description>Контроль лимита задолженности</description>
      <code>00216</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КонтрольПросроченнойЗадолженности</name>
      <description>Контроль просроченной задолженности</description>
      <code>00112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Основной поставщик</description>
      <code>00110</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СостояниеДокументов</name>
      <description>Состояние документов</description>
      <code>00214</code>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </items>
    <items>
      <name>ТоварнаяГруппа</name>
      <description>Товарная группа</description>
      <code>00213</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

snlkuharlocal/src/DataProcessors/ФормированиеМакетовЭтикеток/ObjectModule.bsl
Перем ММвВПикселе;
Перем CodeGenerator;

Функция ПолучитьМакетыЭтикеток(пОбработки) Экспорт
	Результат 		= МаркировкаКС.СтруктураРезультата();
	
	ИмяМакета		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяМакета");	
	Попытка
		Макет = ПолучитьМакет(ИмяМакета);	
	Исключение
		Результат.Ошибки.Добавить(СтрШаблон("Не найден макет: '%1' !", ИмяМакета));					
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецПопытки;	
	
	рПолучения 		= ПолучитьДанныеДляЭтикеток(пОбработки);
	
	Если рПолучения.Успешно Тогда
		Данные = Новый Соответствие;
		
		Для каждого СтрокаТД Из рПолучения.Данные Цикл
			МакетЭтикетки	= СформироватьМакетЭтикети(ИмяМакета, Макет, СтрокаТД); 
			МакетКА			= СформироватьМакетКА(ИмяМакета, Макет, "Коробка",СтрокаТД);
			
			Если НЕ (МакетЭтикетки  = Неопределено ИЛИ МакетКА = Неопределено) Тогда			
				Данные[СтрокаТД.Номенклатура] = Новый Структура("МакетЭтикетки,МакетКА", МакетЭтикетки, МакетКА);				
			Иначе
				Если НЕ ЗначениеЗаполнено(МакетЭтикетки) Тогда				
					Результат.Ошибки.Добавить("Не удалось сформировать макет этикетки !");				
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(МакетКА) Тогда				
					Результат.Ошибки.Добавить("Не удалось сформировать макет коробки !");				
				КонецЕсли;			
				
				Прервать;				
			КонецЕсли;			
		КонецЦикла;
		
		Результат.Данные = Данные;
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
	КонецЕсли;                    
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
		
	Возврат Результат;	
КонецФункции

Функция СформироватьМакетЭтикети(ИмяМакета, Макет, Выборка, Знач ДопПараметры = Неопределено) Экспорт	
	Результат = Неопределено;
	
	Если ИмяМакета = "МакетИнформацияУпаковкаСтикерХлопок70на70Китай" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 {
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяЧНИспайки" 
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяБельеСпайки" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 }
		// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
		Или ИмяМакета = "МакетИнформацияУпаковкаСтикерСинтетикаЧНИ70на70Китай" 
		Или ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" 
		Или ИмяМакета = "МакетИнформацияТестУпаковкаСтикерКолготкиДетскиеКитай" 
		Или ИмяМакета = "МакетинформацияТестУпаковкаСтикерНоскиГольфыДетство" Тогда
		// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
		Результат = СформироватьЭтикетку(Макет, Выборка, ИмяМакета, ДопПараметры);
	ИначеЕсли ИмяМакета = "ДругойМакет" Тогда //Новые макеты вставлять СЮДА (процедуру получения данных просьба НЕ КОПИРОВАТЬ)
		//Результат = СформироватьМакетКА_МакетИнформацияУпаковкаСтикерХлопок70на70Китай(Макет, ТипШК, ДопПараметры);
	Иначе
		Сообщить(СтрШаблон("Отсутствует процедура формирования для макета: '%1' !", Макет), СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //СформироватьМакетЭтикети(СтрокаКМ)

Функция СформироватьМакетКА(ИмяМакета, Макет, ТипШК, ДопПараметры = Неопределено) Экспорт		
	Результат = Неопределено;
	
	Если ИмяМакета = "МакетИнформацияУпаковкаСтикерХлопок70на70Китай" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 {
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяЧНИспайки" 
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяБельеСпайки" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 }
		// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
		Или ИмяМакета = "МакетИнформацияУпаковкаСтикерСинтетикаЧНИ70на70Китай" 
		Или ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" 
		Или ИмяМакета = "МакетИнформацияТестУпаковкаСтикерКолготкиДетскиеКитай" 
		Или ИмяМакета = "МакетинформацияТестУпаковкаСтикерНоскиГольфыДетство" Тогда
		// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
		Результат = СформироватьЭтикеткуМакетКА(Макет, ТипШК, ДопПараметры);
	ИначеЕсли ИмяМакета = "ДругойМакет" Тогда //Новые макеты вставлять СЮДА
		//Результат = СформироватьМакетКА_МакетИнформацияУпаковкаСтикерХлопок70на70Китай(Макет, ТипШК, ДопПараметры);
	Иначе
		Сообщить(СтрШаблон("Отсутствует процедура формирования для макета: '%1' !", Макет), СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
	
Функция СформироватьЭтикетку(Макет, Выборка, ИмяМакета = "", Знач ДопПараметры = Неопределено)
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;
	
	КорректировкаРазмераШрифта	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КорректировкаРазмераШрифта", 0);
	
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
	//Область = Макет.ПолучитьОбласть("Товар|Колонка");
	Если ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" 
		Или ИмяМакета = "МакетинформацияТестУпаковкаСтикерНоскиГольфыДетство" Тогда
		Область = Макет.ПолучитьОбласть("Товар"); //|Колонка"); 
	КонецЕсли;
	
	Если ИмяМакета = "МакетИнформацияУпаковкаСтикерХлопок70на70Китай" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 {
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяЧНИспайки" 
		Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяБельеСпайки" 
		// Кельманов А.В. - MARK-2823 - 2025.11.26 }
		Или ИмяМакета = "МакетИнформацияУпаковкаСтикерСинтетикаЧНИ70на70Китай" 
		Или ИмяМакета = "МакетИнформацияТестУпаковкаСтикерКолготкиДетскиеКитай" 
		Или ИмяМакета = "" Тогда
		Область = Макет.ПолучитьОбласть("Товар|Колонка");
	КонецЕсли;
	
	//ВыводитьЕАН13 = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВыводитьЕАН13", Ложь);
	ВыводитьЕАН13 = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВыводитьЕАН13", Истина);
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	
	Если ВыводитьЕАН13 Тогда
		Рис = Макет.Рисунки.ШК_ЕАН13;
		// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
		// вертикально
		// Кельманов А.В. - MARK-2823 - 2025.11.30 {
		//Если ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" Тогда
		Если ИмяМакета = "МакетИнформацияУпаковкаОбщаяЧЗ" Или ИмяМакета = "МакетЧЗИнформацияСтикерОбщаяБельеСпайки" Тогда
		// Кельманов А.В. - MARK-2823 - 2025.11.30 }
			Картинка = СформироватьКартинкуШК(Выборка.ШтрихКод, Рис, 90);
		// горизонтально
		Иначе
			Картинка = СформироватьКартинкуШК(Выборка.ШтрихКод, Рис);
		КонецЕсли;

		ВывестиШК(Область, "ШК_ЕАН13", Картинка);
		// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	КонецЕсли; 
	
	Область.Параметры.Заполнить(Выборка);
	Область.Параметры.Заполнить(ДопПараметры);	
	
	Возврат Новый Структура("Область,Параметры", Область, ПолучитьПараметрыОбласти(Область));
КонецФункции

// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
Функция СформироватьКартинкуШК(ШтрихКод, рис, УголПоворота=0)
	
	ПараметрыШК = ПараметрыГенерацииШКпоУмолчанию();
	если ММвВПикселе=Неопределено тогда
		Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
		ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	КонецЕсли;
	если CodeGenerator=Неопределено тогда
		КомпонентаФормированияDataMatrixКода();
	КонецЕсли;
	
	ПараметрыШК.ТипКода	= 1;
	
	ПараметрыШК.Высота = Окр(Рис.Высота / ММвВПикселе);
	ПараметрыШК.Ширина = Окр(Рис.Ширина / ММвВПикселе);
	
	ПараметрыШК.Масштабировать = Истина;	
	ПараметрыШК.СохранятьПропорции = Истина;	
	ПараметрыШК.ВертикальноеВыравнивание = 2;	
	
	ПараметрыШК.УголПоворота = УголПоворота;	
	ПараметрыШК.Штрихкод = ШтрихКод;	
	ПараметрыШК.УбратьЛишнийФон	= Истина;
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкодаEAN13(КомпонентаФормированияDataMatrixКода(), ПараметрыШК);
	
	Если НЕ РезультатШтрихкод.Успешно Тогда
		Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка;
	
КонецФункции

Функция ПодготовитьИзображениеШтрихкодаEAN13(ВнешняяКомпонента, ПараметрыШтрихкода)
	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
			Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
		ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции
// Смирнов М.Ю. 01.08.2025 HELP-6117 конец

Функция СформироватьЭтикеткуМакетКА(Макет, ТипШК, ДопПараметры = Неопределено)
	ИмяОбласти 	= ?(ЗначениеЗаполнено(ТипШК), "" + ТипШК, "Коробка");
	
	//Область		= Макет.ПолучитьОбласть(ИмяОбласти + "|Колонка");
	Область		= Макет.ПолучитьОбласть(ИмяОбласти);
	
	//++Данилова Е.В. 16.02.2025 HELP-2851 
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Заголовок") Тогда
		ЗаполнитьЗначенияСвойств(Область.Параметры, ДопПараметры);
	КонецЕсли;
	//--Данилова Е.В. 16.02.2025	
	
	Возврат Новый Структура("Область,Параметры", Область, ПолучитьПараметрыОбласти(Область));
КонецФункции //СформироватьКА(Макет, КодАгрегации, НомерКороба, КоличествоШтук, Выборка, УголПоворота = 0)

//При передаче в ФЗ не сериализуются объекты типа "ПараметрыОбласти" - приходится дублировать
//А еще и ключи получить нельзя - надо передавать массив - песня !
Функция ПолучитьПараметрыОбласти(Область)	
	пОбласти = Новый Массив;
	Для каждого ЗначениеПараметра Из Область.Параметры Цикл
		пОбласти.Добавить(ЗначениеПараметра);
	КонецЦикла;
	Возврат пОбласти;
КонецФункции //ПолучитьПараметрыОбласти(Область)

#Область ПечатьDataMatrix

Процедура ВывестиШК(Область, ИмяРисунка, Картинка) Экспорт
	Рис 				= Область.Рисунки[ИмяРисунка];
	
	Рис.РазмерКартинки	= РазмерКартинки.Пропорционально;
	Рис.Линия			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
	Рис.Картинка 		= Картинка;
КонецПроцедуры //ВывестиШК(Область, ИмяРисунка, Картинка)

Функция СформироватьКартинкуШК_EAN(Знач ШтрихКод, Рис, ДопПараметры = Неопределено) Экспорт    
	Если ММвВПикселе = Неопределено Тогда
		ЗаполнитьММвВПикселе();	
	КонецЕсли; 
	
	КорректировкаРазмераШрифта = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "КорректировкаРазмераШрифта", 0);
	
	ПараметрыШК = ПараметрыГенерацииШКпоУмолчанию();	
	
	ПараметрыШК.ТипКода			= 2;
	
	К = 150/Мин(Рис.Высота, Рис.Ширина);
	
	мВысота = Окр(Рис.Высота / ММвВПикселе);
	мШирина = Окр(Рис.Ширина / ММвВПикселе);	
	
	УголПоворота = ?(мВысота > мШирина, 90, 0);
	
	ПараметрыШК.Высота	= мВысота;
	ПараметрыШК.Ширина	= мШирина;	
	
	// Смирнов М.Ю. 01.08.2025 HELP-6117 начало
	//ПараметрыШК.ОтображатьТекст = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ОтображатьТекст", Истина);
	ПараметрыШК.ОтображатьТекст = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ОтображатьТекст", Ложь);
	// Смирнов М.Ю. 01.08.2025 HELP-6117 конец
	ПараметрыШК.УголПоворота	= УголПоворота;	
	
	ПараметрыШК.РазмерШрифта	= Цел(12*К) + КорректировкаРазмераШрифта;	
	ПараметрыШК.Штрихкод		= ШтрихКод;
	
	Если МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "АгрегацииВCode128", Ложь) Тогда
		ПараметрыШК.ТипКода			= 4;
		ПараметрыШК.Штрихкод		= СтрЗаменить(ШтрихКод, "(00)", "");	
	КонецЕсли;	
	
	РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШК);
	
    Если НЕ РезультатШтрихкод.Успешно Тогда
        Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
    КонецЕсли;
 
    Возврат РезультатШтрихкод.Картинка;
 
КонецФункции

Функция СформироватьКартинкуШК_DataMatrix(Знач ШтрихКод) Экспорт
	
	ПараметрыШтрихкода = ПараметрыГенерацииШКпоУмолчанию();
	ПараметрыШтрихкода.ТипВходныхДанных = 1; // Тип входных данных (0-Строка, 1-Base64).
	 
	ПараметрыШтрихкода.ТипКода	= 24; //24(тип кода - GS1 databar extended stacked), [с версии 9.0.2.2],
	ПараметрыШтрихкода.Штрихкод	= Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ШтрихКод));
    
    РезультатШтрихкод = ПодготовитьИзображениеШтрихкода(КомпонентаФормированияDataMatrixКода(), ПараметрыШтрихкода);
 
    Если НЕ РезультатШтрихкод.Успешно Тогда
        Сообщить(СтрШаблон("Ошибка генерации изображения штрихкода: '%1'", ШтрихКод));	
    КонецЕсли;
 
    Возврат РезультатШтрихкод.Картинка;
 
КонецФункции

Функция ПодготовитьИзображениеШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода)	
	// Результат 
	РезультатОперации = Новый Структура("Успешно,ДвоичныеДанные,Картинка", Ложь);	
	
	// Зададим размер формируемой картинки.
	ШиринаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Ширина),1);
	ВысотаШтрихкода = Макс(Окр(ПараметрыШтрихкода.Высота),1);	
	
	ВнешняяКомпонента.Ширина = ШиринаШтрихкода;
	ВнешняяКомпонента.Высота = ВысотаШтрихкода;
	ВнешняяКомпонента.АвтоТип = Ложь;
	
	ШтрихкодВрем = Строка(ПараметрыШтрихкода.Штрихкод); // Преобразуем явно в строку.
	
	Если ПараметрыШтрихкода.ТипКода = 99 Тогда
		ВнешняяКомпонента.АвтоТип = Истина;
	Иначе
		ВнешняяКомпонента.АвтоТип = Ложь;
		ВнешняяКомпонента.ТипКода = ПараметрыШтрихкода.ТипКода;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ПрозрачныйФон") Тогда
		ВнешняяКомпонента.ПрозрачныйФон = ПараметрыШтрихкода.ПрозрачныйФон;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("ТипВходныхДанных") Тогда
		ВнешняяКомпонента.ТипВходныхДанных = ПараметрыШтрихкода.ТипВходныхДанных;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("GS1DatabarКоличествоСтрок") Тогда
		ВнешняяКомпонента.GS1DatabarКоличествоСтрок = ПараметрыШтрихкода.GS1DatabarКоличествоСтрок;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("УбратьЛишнийФон") Тогда
		ВнешняяКомпонента.УбратьЛишнийФон = ПараметрыШтрихкода.УбратьЛишнийФон;
	КонецЕсли;
	
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	// Формируем картинку штрихкода.
	ВнешняяКомпонента.ЗначениеКода = ШтрихкодВрем;
	// Угол поворота штрихкода.
	ВнешняяКомпонента.УголПоворота = ?(ПараметрыШтрихкода.Свойство("УголПоворота"), ПараметрыШтрихкода.УголПоворота, 0);
	// Уровень коррекции QR кода (L=0, M=1, Q=2, H=3).
	ВнешняяКомпонента.УровеньКоррекцииQR = ?(ПараметрыШтрихкода.Свойство("УровеньКоррекцииQR"), ПараметрыШтрихкода.УровеньКоррекцииQR, 1);
	
	// Для обеспечения совместимости с предыдущими версиями БПО.
	Если Не ПараметрыШтрихкода.Свойство("Масштабировать")
		Или (ПараметрыШтрихкода.Свойство("Масштабировать") И ПараметрыШтрихкода.Масштабировать) Тогда
		
		Если Не ПараметрыШтрихкода.Свойство("СохранятьПропорции")
				Или (ПараметрыШтрихкода.Свойство("СохранятьПропорции") И Не ПараметрыШтрихкода.СохранятьПропорции) Тогда
			// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
				ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
			КонецЕсли;
			// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
			Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
				ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
			КонецЕсли;
		ИначеЕсли ПараметрыШтрихкода.Свойство("СохранятьПропорции") И ПараметрыШтрихкода.СохранятьПропорции Тогда
			Пока ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода 
				Или ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Цикл
				// Если установленная нами ширина меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
					ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода;
					ВнешняяКомпонента.Высота = Окр(ВнешняяКомпонента.МинимальнаяШиринаКода / ШиринаШтрихкода) * ВысотаШтрихкода;
				КонецЕсли;
				// Если установленная нами высота меньше минимально допустимой для этого штрихкода.
				Если ВнешняяКомпонента.Высота < ВнешняяКомпонента.МинимальнаяВысотаКода Тогда
					ВнешняяКомпонента.Высота = ВнешняяКомпонента.МинимальнаяВысотаКода;
					ВнешняяКомпонента.Ширина = Окр(ВнешняяКомпонента.МинимальнаяВысотаКода / ВысотаШтрихкода) * ШиринаШтрихкода;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// ВертикальноеВыравниваниеКода: 1 - по верхнему краю, 2 - по центру, 3 - по нижнему краю.
	Если ПараметрыШтрихкода.Свойство("ВертикальноеВыравнивание") И (ПараметрыШтрихкода.ВертикальноеВыравнивание > 0) Тогда
		ВнешняяКомпонента.ВертикальноеВыравниваниеКода = ПараметрыШтрихкода.ВертикальноеВыравнивание;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И (ПараметрыШтрихкода.РазмерШрифта > 0) 
		И (ПараметрыШтрихкода.ОтображатьТекст) И (ВнешняяКомпонента.РазмерШрифта <> ПараметрыШтрихкода.РазмерШрифта) Тогда
			ВнешняяКомпонента.РазмерШрифта = ПараметрыШтрихкода.РазмерШрифта;
	КонецЕсли;
	
	Если ПараметрыШтрихкода.Свойство("РазмерШрифта") И ПараметрыШтрихкода.РазмерШрифта > 0
		И ПараметрыШтрихкода.Свойство("МонохромныйШрифт") Тогда
		Если ПараметрыШтрихкода.МонохромныйШрифт Тогда
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = ПараметрыШтрихкода.РазмерШрифта + 1;
		Иначе
			ВнешняяКомпонента.МаксимальныйРазмерШрифтаДляПринтеровНизкогоРазрешения = -1;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда // QR
		Если ПараметрыШтрихкода.Свойство("ЛоготипКартинка") И ЗначениеЗаполнено(ПараметрыШтрихкода.ЛоготипКартинка) Тогда 
			ВнешняяКомпонента.ЛоготипКартинка = ПараметрыШтрихкода.ЛоготипКартинка;    
		Иначе
			ВнешняяКомпонента.ЛоготипКартинка = "";
		КонецЕсли;
		Если ПараметрыШтрихкода.Свойство("ЛоготипРазмерПроцентОтШК") И Не ПустаяСтрока(ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК) Тогда 
			ВнешняяКомпонента.ЛоготипРазмерПроцентОтШК = ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК;
		КонецЕсли;
	КонецЕсли;
	
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки 		= ВнешняяКомпонента.ПолучитьШтрихкод();
	РезультатОперации.Успешно 	= (ВнешняяКомпонента.Результат = 0);
	// Если картинка сформировалась.
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		РезультатОперации.ДвоичныеДанные	= ДвоичныеДанныеКартинки;
		РезультатОперации.Картинка 			= Новый Картинка(ДвоичныеДанныеКартинки); // Формируем из двоичных данных.
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПараметрыГенерацииШКпоУмолчанию()
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция КомпонентаФормированияDataMatrixКода()
	Если CodeGenerator <> Неопределено Тогда
		Возврат CodeGenerator;	
	КонецЕсли; 
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации DataMatrix-кода.'");
	
	рПодключения = ПодключитьКомпонентуИзМакета_("Barcode", "ОбщийМакет.КомпонентаПечатиШтрихкодов");
	CodeGenerator = рПодключения.Данные;
	Если CodeGenerator = Неопределено Тогда 
		МаркировкаКС.ВывестиОшибки(рПодключения);
		ЗаписатьВЛог("Отладка", СтрСоединить(рПодключения.Ошибки, Символы.ПС), "Ошибка");
	КонецЕсли;
	
	Возврат CodeGenerator;	
КонецФункции

Процедура ЗаполнитьММвВПикселе()

	Эталон 		= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьМакет("Эталон");
	ММвВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;

КонецПроцедуры

Функция ПодключитьКомпонентуИзМакета_(Идентификатор, ПолноеИмяМакета)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ПодключаемыйМодуль	= Неопределено;
	
	Местоположение 		= ПолноеИмяМакета;
	СимволическоеИмя 	= Идентификатор + "SymbolicName";
	
	Если ПодключитьВнешнююКомпоненту(Местоположение, СимволическоеИмя, , ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		
		Попытка
			ПодключаемыйМодуль = Новый("AddIn." + СимволическоеИмя + "." + Идентификатор);
			Если ПодключаемыйМодуль = Неопределено Тогда 
				ВызватьИсключение НСтр("ru = 'Оператор Новый вернул Неопределено'");
			КонецЕсли;
		Исключение
			ПодключаемыйМодуль = Неопределено;
			//ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если ПодключаемыйМодуль = Неопределено Тогда
			
			ТекстОшибки = СтрШаблон(
			"Не удалось создать объект внешней компоненты '%1', подключенной на сервере
			|из макета '%2',
			|по причине:
			|%3.",
			Идентификатор,
			Местоположение,
			ТекстОшибки);
			
			Результат.Ошибки.Добавить(ТекстОшибки);
		Иначе
			Результат.Данные = ПодключаемыйМодуль;
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = СтрШаблон(
			"Не удалось подключить внешнюю компоненту '%1' на сервере
			|из макета '%2'
			|по причине:
			|Метод ПодключитьВнешнююКомпоненту вернул Ложь.",
			Идентификатор,
			Местоположение
		);
		
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЕсли;   
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанныхДляЭтикеток

//Кухарь А.Ю.  14.03.2025 начало
// Пустая задача 
Функция ПолучитьДанныеДляЭтикеток(пОбработки)
	Результат 		= МаркировкаКС.СтруктураРезультата();
	
	Если Ложь Тогда ЗПС = документы.ЗаказПоставщику.СоздатьДокумент(); КонецЕсли;
	
	мНоменклатура 	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Номенклатура");
	ЗПС				= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ДокОснование");
	ИмяМакета		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИмяМакета");
	
	ДанныеИзготовителя	= ЗаполнитьДанныеИзготовителя(ЗПС, ИмяМакета);
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	//ДатаВыпуска			= ПустаяДата();
	Если ТипЗнч(пОбработки) = Тип("Структура") И пОбработки.Свойство("ДатаВыпуска") 
			И ЗначениеЗаполнено(пОбработки.ДатаВыпуска) Тогда
		ДатаВыпуска = пОбработки.ДатаВыпуска;
	Иначе
		ОснованиеЗПС		= ПолучитьРеквизитШапки(ЗПС, "ДокОснование");
		Если ЗначениеЗаполнено(ОснованиеЗПС) И ТипЗнч(ОснованиеЗПС) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			ДатаВыпуска = ПолучитьРеквизитШапки(ОснованиеЗПС, "Контракт.ДатаКонтракта");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаВыпуска) тогда
			ДатаВыпуска = ПолучитьРеквизитШапки(ЗПС, "ДокОснование.Дата");
		КонецЕсли;                                  
		Если НЕ ЗначениеЗаполнено(ДатаВыпуска) тогда
			ДатаВыпуска = ТекущаяДата()		
		КонецЕсли;
	КонецЕсли;
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	ОснованиеЗПС		= ПолучитьРеквизитШапки(ЗПС, "ДокОснование");
	
	ДанныеОрганизации=ЗаполнитьДанныеОрганизации();
	
	Запрос = Новый запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура		КАК Номенклатура,
	|	АртикулаНосков.Значение 				КАК АртикулДляПечатиНосковНаСтикере,
	|	АртикулаКолготок.Значение				КАК АртикулДляПечатиКолготокНаСтикере,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет 	КАК Цвет,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер	КАК Размер,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.КодПроизводителя КАК КодПроизводителя,
	|	ЗаказПоставщикуТовары.Номенклатура.Состав 	КАК НоменклатураСостав,
	|	ЗаказПоставщикуТовары.Номенклатура.Цвет.РусскоеНаименование КАК ЦветРусский,
	|	ЗаказПоставщикуТовары.Номенклатура.Размер 	КАК ПростоРазмер,
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ОбхватГруди,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ОбхватПодГрудью,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК Рост,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ОбхватТалии,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ОбхватБедер,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК РеквизитыРазмера,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК Изготовитель,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК Изготовитель2,
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	|	ЗаказПоставщикуТовары.Номенклатура.ДопПараметрРазмера КАК ДопПараметрРазмера,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.Состав КАК Состав,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.Состав КАК СоставДляСпорта,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.ТипТовара КАК ТипТовара,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель.ФР_ТипТовара КАК ФР_ТипТовара,
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(20)) КАК ШтрихКод,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(20)) КАК ДатаВыпуска,
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель КАК Модель,
	|	ЗаказПоставщикуТовары.Ссылка.Организация КАК Организация,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.ИНН КАК ИННОрганизации,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.КПП КАК КППОрганизации,
	|	ЗаказПоставщикуТовары.Ссылка.Организация.Телефоны КАК ТелефонОрганизации,
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК ЮрАдресОрганизации,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК ИмпортерИстория,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК ИННИмпортера,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК КППИмпортера
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК АртикулаНосков
	|ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель = АртикулаНосков.Объект
	|	И (АртикулаНосков.Свойство = &АртикулДляПечатиНосковНаСтикере)
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК АртикулаКолготок
	|ПО 
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель = АртикулаКолготок.Объект
	|	И (АртикулаКолготок.Свойство = &АртикулДляПечатиКолготокНаСтикере)
	|ГДЕ
	|	ЗаказПоставщикуТовары.Количество > 0
	|	И ЗаказПоставщикуТовары.Ссылка.Ссылка = &Ссылка
	|	И ЗаказПоставщикуТовары.Номенклатура В (&мНоменклатура)
	|";	
	
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	Если ТипЗнч(ЗПС) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ЗаказПоставщику.", СтрШаблон(".%1.", ЗПС.Метаданные().Имя));
	КонецЕсли;
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	
	Запрос.УстановитьПараметр("Ссылка",			ЗПС);	
	
	Запрос.УстановитьПараметр("АртикулДляПечатиНосковНаСтикере", 			ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АртикулДляПечатиНосковНаСтикере", Истина));
	Запрос.УстановитьПараметр("АртикулДляПечатиКолготокНаСтикере", 	ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("АртикулДляПечатиКолготокНаСтикере", Истина));
	
	Запрос.УстановитьПараметр("мНоменклатура", мНоменклатура);
	
	ДанныеДляЭтикеток = Запрос.Выполнить().Выгрузить();

	#Область ПоляЭтикеток		
	
	Поля = Новый Массив;
	Для Каждого Кол Из ДанныеДляЭтикеток.Колонки Цикл
		Поля.Добавить(Кол.Имя);
	КонецЦикла;
	
	СтрокаПолей = СтрСоединить(Поля, ",");
	
	//Номенклатура
	//АртикулДляПечатиНосков
	//АртикулДляПечатиКолготокНаСтикере
	//Цвет
	//Размер
	//КодПроизводителя
	//НоменклатураСостав
	//ЦветРусский
	//ПростоРазмер
	//ОбхватГруди
	//ОбхватПодГрудью
	//Рост
	//ОбхватТалии
	//ОбхватБедер
	//РеквизитыРазмера
	//Изготовитель
	//Изготовитель2
	//ДопПараметрРазмера
	//Состав
	//СоставДляСпорта
	//ТипТовара
	//ФР_ТипТовара
	//ШтрихКод
	//ДатаВыпуска
	//Модель
	//Организация
	//ИННОрганизации
	//КППОрганизации
	//ТелефонОрганизации	        
	#КонецОбласти                       
	
	ДопПараметры = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ДопПараметры");	
	Если НЕ ЗначениеЗаполнено(ДопПараметры) Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	//ДопПараметры.Вставить("ДатаВыпуска", ВРег(Формат(ДатаВыпуска,"ДФ='MMMM yyyy'")));
	ДопПараметры.Вставить("ДатаВыпуска", Формат(ДатаВыпуска,"ДФ='MMMM yyyy'"));
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	
	Для Каждого СтрокаТД из ДанныеДляЭтикеток цикл
		ЗаполнитьЗначенияСвойств(СтрокаТД, ДанныеИзготовителя);
		ЗаполнитьЗначенияСвойств(СтрокаТД, ДанныеОрганизации);
	
		НаборВремПолей = ПолучитьРеквизитыРазмера(СтрокаТД.Размер, ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТД, НаборВремПолей);
		
		НаборВремПолей = ПерезаполнитьСостав(СтрокаТД.Номенклатура, ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТД, НаборВремПолей);
		
		НаборВремПолей = ПерезаполнитьТипТовара(СтрокаТД.ТипТовара, ИмяМакета);
		ЗаполнитьЗначенияСвойств(СтрокаТД, НаборВремПолей);
		
		// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
		//ДопУсловие="	И подстрока(ШтрихКоды.Описание,1,3) = ""GS1""";
		ДопУсловие="	И ШтрихКоды.ЭтоКодGS1 = Истина";
		// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
		СтрокаТД.ШтрихКод = ПолучитьШтрихКодТовара(СтрокаТД.Номенклатура, Перечисления.ТипыШтрихКодов.Штука, Перечисления.ВидыШК.Основной, , ДопУсловие, Истина);	
		
		// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
		//НаборВремПолей = ДанныеИмпортёра(ИмяМакета, СтрокаТД.Модель, ДатаВыпуска);
		//ЗаполнитьЗначенияСвойств(СтрокаТД, НаборВремПолей);
		Если ТипЗнч(пОбработки) = Тип("Структура") И пОбработки.Свойство("Импортер") 
			И ЗначениеЗаполнено(пОбработки.Импортер) Тогда
			НаборВремПолей = ПолучитьРеквизитыШапки(пОбработки.Импортер, "Наименование, ЮридическийАдрес, ИНН, КПП");
			СтрокаТД.ИмпортерИстория = СтрШаблон("%1, %2", НаборВремПолей.Наименование, НаборВремПолей.ЮридическийАдрес);
			СтрокаТД.ИННИмпортера = НаборВремПолей.ИНН; 
			СтрокаТД.КППИмпортера = НаборВремПолей.КПП;
		Иначе
			НаборВремПолей = ДанныеИмпортёра(ИмяМакета, СтрокаТД.Модель, ДатаВыпуска);
			ЗаполнитьЗначенияСвойств(СтрокаТД, НаборВремПолей);
		КонецЕсли;
		// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
		ЗаполнитьЗначенияСвойств(СтрокаТД, ДопПараметры);		
	КонецЦикла;
	
	Результат.Данные = ДанныеДляЭтикеток;
	
	Возврат Результат;	
КонецФункции

Функция ПолучитьРеквизитыРазмера (Размер,ИмяМакета)
	
	НаборПолей = новый Структура;
	НаборПолей.Вставить("ОбхватГруди",""); 
	НаборПолей.Вставить("ОбхватПодГрудью",""); 
	НаборПолей.Вставить("Рост",""); 
	НаборПолей.Вставить("ОбхватТалии",""); 
	НаборПолей.Вставить("ОбхватБедер",""); 
	НаборПолей.Вставить("РеквизитыРазмера","");
	МассивРеквизитовРазмера=новый Массив;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|ГДЕ
	|	РеквизитыСправочников.Справочник = &Размер";
	запрос.УстановитьПараметр("Размер",Размер);
	ВыборкаРеквизитыРазмера=запрос.Выполнить().Выбрать();
	пока ВыборкаРеквизитыРазмера.Следующий() цикл
		если ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхват под грудью" или ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхватподгрудью" тогда
			НаборПолей.ОбхватПодГрудью="Обхват под грудью:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="Обхватбедер" тогда
			НаборПолей.ОбхватБедер="Обхват бедер:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="ОбхватГруди" тогда
			НаборПолей.ОбхватГруди="Обхват груди:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="Рост" тогда
			НаборПолей.Рост="Рост:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		ИначеЕсли  ВыборкаРеквизитыРазмера.ИмяРеквизита="ОбхватТалии" тогда
			НаборПолей.ОбхватТалии="Обхват талии:"+ВыборкаРеквизитыРазмера.ЗначениеРеквизита;
		иначе
			Продолжить;;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборПолей.ОбхватГруди <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватГруди);
	КонецЕсли;
	Если НаборПолей.ОбхватПодГрудью <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватПодГрудью);
	КонецЕсли;	
	Если НаборПолей.ОбхватТалии <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватТалии);
	КонецЕсли;
	Если НаборПолей.ОбхватБедер <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.ОбхватБедер);
	КонецЕсли;
	Если НаборПолей.Рост <> "" Тогда
		МассивРеквизитовРазмера.Добавить(НаборПолей.Рост);
	КонецЕсли;	
	
	НаборПолей.РеквизитыРазмера=СтрСоединить(МассивРеквизитовРазмера,символы.ПС);
	
	возврат НаборПолей;
КонецФункции

Функция ПерезаполнитьСостав (Номенклатура,ИмяМакета)
	НаборПолей=новый Структура;
	ТЧСостав			= Номенклатура.Родитель.СоставНоменклатуры;
	СоставДляСпорта="";
	МассивМатериаловПроцентВКонце=новый Массив;
	
	Для каждого СтрТЧ из ТЧСостав цикл
		СоставДляСпорта=СоставДляСпорта+СтрТЧ.Процент+"% "+СтрТЧ.МатериалСостав.АнглоязычноеНаименование+ " | "+СтрТЧ.МатериалСостав.Наименование+","+Символы.ПС;
		МассивМатериаловПроцентВКонце.Добавить(""+СтрТЧ.МатериалСостав+" %");	
	КонецЦикла;
	
	если ИмяМакета="МакетИнформацияУпаковкаОбщаяЧЗ" тогда
		ТекСостав=СтрСоединить(МассивМатериаловПроцентВКонце);	
	КонецЕсли;
	
	если СтрДлина(СоставДляСпорта)>1 тогда
		СоставДляСпорта=Сред(СоставДляСпорта,1,СтрДлина(СоставДляСпорта)-2);
		НаборПолей.Вставить("СоставДляСпорта",СоставДляСпорта);
		НаборПолей.СоставДляСпорта=СтрЗаменить(НаборПолей.составдляспорта,"100% CO | Ластовица Хлопок","Lining| Состав Ластовицы:100% CO| Хлопок"); 	
	КонецЕсли;
	
	ТекСостав=ПолучитьРеквизитРодителя(Номенклатура,"Состав");
	ТекСостав=СтрЗаменить(ТекСостав,"Хлопок","Cotton\Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"Полиамид","Polyamide\Полиамид");
	ТекСостав=СтрЗаменить(ТекСостав,"Эластан","Elastane\Эластан");
	ТекСостав=СтрЗаменить(ТекСостав,"Люрекс","Lurex\Люрекс");
	ТекСостав=СтрЗаменить(ТекСостав,"люрекс","Lurex\Люрекс");	
	ТекСостав=СтрЗаменить(ТекСостав,"Бамбук","Bamboo\Бамбук");
	ТекСостав=СтрЗаменить(ТекСостав,"Полиэстер","Polyester\Полиэстер");
	ТекСостав=СтрЗаменить(ТекСостав,"Мерс.Хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"мерс. хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"Мерс. хлопок","Mers.Cotton\Мерс.Хлопок");	
	ТекСостав=СтрЗаменить(ТекСостав,"Вискоза","Viscose\Вискоза");
	ТекСостав=СтрЗаменить(ТекСостав,"Шерсть","Wool\Шерсть");
	ТекСостав=СтрЗаменить(ТекСостав,"Ангора","Angora\Ангора");
	ТекСостав=СтрЗаменить(ТекСостав,"Акрил","Acrylic\Акрил");
	ТекСостав=СтрЗаменить(ТекСостав,"Крапива","Nettle\Крапива");
	ТекСостав=СтрЗаменить(ТекСостав,"Лавсан","Lavsan\Лавсан");
	ТекСостав=СтрЗаменить(ТекСостав,"Микромодал","Micromodal\Микромодaл");
	ТекСостав=СтрЗаменить(ТекСостав,"Модал","Modal\Модал");
	ТекСостав=СтрЗаменить(ТекСостав,"модал","Modal\Модал");
	
	ТекСостав=СтрЗаменить(ТекСостав,"Кашемир","Cashmere\Кашемир");	
	ТекСостав=СтрЗаменить(ТекСостав,"Шелк","Silk\Шелк");
	ТекСостав=СтрЗаменить(ТекСостав,"Шерсть мериноса","Merino wool\Шерсть мериноса");
	ТекСостав=СтрЗаменить(ТекСостав,"Элит","Elit\Элит");
	ТекСостав=СтрЗаменить(ТекСостав,"Протеин молока","Milk protein\Протеин молока");
	ТекСостав=СтрЗаменить(ТекСостав,"Поликолон","Polycolon\Поликолон");
	ТекСостав=СтрЗаменить(ТекСостав,"Термолайт","Thermolite\Термолайт");
	ТекСостав=СтрЗаменить(ТекСостав,"Нейлон","Nylon\Нейлон");
	ТекСостав=СтрЗаменить(ТекСостав,"нейлон","Nylon\Нейлон");
	
	ТекСостав=СтрЗаменить(ТекСостав,"хлопок","Cotton\Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"полиамид","Polyamide\Полиамид");
	ТекСостав=СтрЗаменить(ТекСостав,"эластан","Elastane\Эластан");
	ТекСостав=СтрЗаменить(ТекСостав,"бамбук","Bamboo\Бамбук");
	ТекСостав=СтрЗаменить(ТекСостав,"полиэстер","Polyester\Полиэстер");
	ТекСостав=СтрЗаменить(ТекСостав,"мерс.хлопок","Mers.Cotton\Мерс.Хлопок");
	ТекСостав=СтрЗаменить(ТекСостав,"вискоза","Viscose\Вискоза");
	ТекСостав=СтрЗаменить(ТекСостав,"шерсть","Wool\Шерсть");
	ТекСостав=СтрЗаменить(ТекСостав,"ангора","Angora\Ангора");
	ТекСостав=СтрЗаменить(ТекСостав,"акрил","Acrylic\Акрил");
	ТекСостав=СтрЗаменить(ТекСостав,"крапива","Nettle\Крапива");
	ТекСостав=СтрЗаменить(ТекСостав,"лавсан","Lavsan\Лавсан");
	ТекСостав=СтрЗаменить(ТекСостав,"микромодал","Micromodal\Микромодал");
	ТекСостав=СтрЗаменить(ТекСостав,"кашемир","Cashmere\Кашемир");	
	ТекСостав=СтрЗаменить(ТекСостав,"шелк","Silk\Шелк");
	ТекСостав=СтрЗаменить(ТекСостав,"шерсть мериноса","Merino wool\Шерсть мериноса");
	ТекСостав=СтрЗаменить(ТекСостав,"элит","Elit\Элит");
	ТекСостав=СтрЗаменить(ТекСостав,"протеин молока","Milk protein\Протеин молока");
	ТекСостав=СтрЗаменить(ТекСостав,"поликолон","Polycolon\Поликолон");
	ТекСостав=СтрЗаменить(ТекСостав,"термолайт","Thermolite\Термолайт");	
	ТекСостав=СтрЗаменить(ТекСостав,"Полиэфир","Polyether\Полиэфир");	
	ТекСостав=СтрЗаменить(ТекСостав,"Металлизированная нить","Metallized thread\Металлизированная нить");	
	если ИмяМакета="МакетИнформацияУпаковкаОбщаяЧЗ" тогда
		ТекСостав=СтрЗаменить(ТекСостав,"100% Ластовица Cotton\Хлопок",символы.ПС+"Состав ластовицы:100% Cotton/Хлопок");	
		ТекСостав=СтрЗаменить(ТекСостав,"Ластовица 100% Cotton\Хлопок",символы.ПС+"Состав ластовицы:100% Cotton/Хлопок");	
	КонецЕсли;
	НаборПолей.Вставить("Состав", ТекСостав);

	возврат НаборПолей;
КонецФункции

Функция ПерезаполнитьТипТовара (ТипТовара,ИмяМакета)
	НаборПолей=новый Структура;
	ТипТовара			= СокрЛП(ТипТовара);				
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"дет.","детские");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"жен.","женские");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"муж.","мужские");	
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"Гольфины","получулки");
	ТипТовара=СтрЗаменить(Строка(ТипТовара),"гольфины","получулки");	
	ТипТовара=СтрЗаменить(Строка(ТипТовара),".","");
	НаборПолей.Вставить("ТипТовара",ТипТовара);
	
	Возврат НаборПолей;	
КонецФункции

Функция ЗаполнитьДанныеИзготовителя (ЗПС,ИмяМакета)
	РеквизитыШапки = ПолучитьРеквизитыШапки(зпс,"Контрагент,Контрагент.Код,Контрагент.ЮридическийАдрес,Контрагент.ПолноеНаименование,Контрагент.ПочтовыйАдрес","Документ");
	НаборПолей=новый Структура();
	КодКонтрагента=РеквизитыШапки.Контрагент_Код;
	если КодКонтрагента ="SSR-7303" или  КодКонтрагента="SSP-4032"  тогда    //Пром-Текс ООО (носки GRIFF) и Арт-текс
		Изготовитель=РеквизитыШапки.Контрагент_ПочтовыйАдрес;
		Импортер=Справочники.Организации.ПустаяСсылка();
	иначе
		Изготовитель=РеквизитыШапки.Контрагент_ПолноеНаименование+". "+РеквизитыШапки.Контрагент_ЮридическийАдрес;
	КонецЕсли;
	изготовитель=СтрЗаменить(Изготовитель,"Поставщик ","");
	// Андреев И.Д. 16.02.2021 конец
	НаборПолей.Вставить("Изготовитель", ?(Изготовитель="","","Изготовитель и его адрес: "+Изготовитель));
	НаборПолей.Вставить("Изготовитель2", ?(Изготовитель="","","Изготовитель и его адрес: "+Изготовитель));		
	возврат НаборПолей;
КонецФункции

Функция ДанныеИмпортёра (ИмяМакета,Модель,ДатаВыпуска,Фабрика="",Страна=Неопределено)
	НаборПолей=новый Структура;
	ИмпортерИстория=Неопределено;
	
	если ЗначениеЗаполнено(Страна) Тогда 
		ОтборДляГТД=новый Структура;
		ОтборДляГТД.Вставить("Страна",Страна);
		ГТД = ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",,ОтборДляГТД);
		если ГТД=Неопределено тогда
			ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера");
		КонецЕсли;	
	иначе
		ГТД = ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД");
		если ГТД=Неопределено тогда
			ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера");
		КонецЕсли;
	КонецЕсли;
	
	
	Если (ГТД <> Неопределено или ГТД=Справочники.ГТД.НайтиПоНаименованию("Без номера")) Тогда
		//если (ЗначениеЗаполнено(Страна) и ГТД.СтранаПроисхождения <>  Страна)  тогда
		//	НаборПолей.Вставить("Импортер", Справочники.Контрагенты.ПустаяСсылка());
		//	НаборПолей.Вставить("ЮрАдресИмпортера", "");
		//иначе
			ИмпортерИстория = ГТД.Импортер;
			ИмпортердляИстории = ГТД.Импортер.ПолноеНаименование;
			НаборПолей.Вставить("Импортер", ИмпортерИстория);
			ЮрАдресОрганизации=ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников("ЮридическийАдрес",ИмпортерИстория,ДатаВыпуска); 
			если ЮрАдресОрганизации=Неопределено тогда
				ЮрАдресОрганизации=ИмпортерИстория.ЮридическийАдрес;
			КонецЕсли;
			НаборПолей.Вставить("ЮрАдресИмпортера", ЮрАдресОрганизации);
			НаборПолей.Вставить("ИмпортерИстория", Строка(ИмпортердляИстории)+", "+Строка(ЮрАдресОрганизации));
		//КонецЕсли;
	КонецЕсли;	
	
	НаборПолей.Вставить("ГТД", ГТД);
	
	
	
	если ЗначениеЗаполнено(Страна) тогда
		ОтборДляГТД=новый Структура;
		ОтборДляГТД.Вставить("Страна",Страна);
		Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата(),,,ОтборДляГТД);		
	иначе
		Декларация = ПолучитьПериодическийРеквизит(Модель,"Декларация",ТекущаяДата());
	КонецЕсли;
	
	если Декларация<>Неопределено тогда 
		НаборПолей.Вставить("Декларация", декларация);
		НаборПолей.Вставить("фабрика",?(Фабрика="","","Адрес по изготовлению продукции: "+Фабрика+" "));		 
		
		//если ЗначениеЗаполнено(Страна) и ГТД.СтранаПроисхождения <>  Страна тогда
		//	НаборПолей.Вставить("Декларация", Неопределено);	
		//иначе
			
			НаборПолей.Вставить("Импортер",СтрЗаменить(Декларация.организация,"«Стиль Трейд»","""Стиль Трейд"""));
			
			ЮрАдресОрганизации=ПолучитьПоследнееЗначениеИзПериодическиеРеквизитыДокументовИСправочников("ЮридическийАдрес",Декларация.организация,ДатаВыпуска); 
			если ЮрАдресОрганизации=Неопределено тогда
				ЮрАдресОрганизации=Декларация.организация.ЮридическийАдрес;
			КонецЕсли;
			НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресОрганизации);
		//КонецЕсли;
		
		//если ЗначениеЗаполнено(Импортер) тогда	
		//	НаборПолей.Вставить("Импортер",Импортер);
		//	НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресИмпортера);
		//КонецЕсли;
	иначе
		//НаборПолей.Вставить("Декларация", Неопределено);
		//НаборПолей.Вставить("фабрика",?(Фабрика="","","Адрес по изготовлению продукции: "+Фабрика+" "));			
		//если ЗначениеЗаполнено(Импортер) тогда	
		//	НаборПолей.Вставить("Импортер",Импортер);
		//	НаборПолей.Вставить("ЮрАдресИмпортера",ЮрАдресИмпортера);
		//КонецЕсли;
	КонецЕсли;
	если ЗначениеЗаполнено(ИмпортерИстория) тогда
		НаборПолей.Вставить("ИННИмпортера", ИмпортерИстория.ИНН);
		НаборПолей.Вставить("КППИмпортера", ИмпортерИстория.КПП);
	КонецЕсли;
	возврат НаборПолей;
КонецФункции

Функция ЗаполнитьДанныеОрганизации()
		
	НаборПолей=новый Структура;
	ЕЕЭ=ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("ОсновнаяОрганизацияУправленческогоУчета");
	НаборПолей.Вставить("Организация", ЕЕЭ);
	НаборПолей.Вставить("ИННОрганизации", ЕЕЭ.ИНН);
	НаборПолей.Вставить("КППОрганизации", ЕЕЭ.КПП);
	НаборПолей.Вставить("ТелефонОрганизации", ЕЕЭ.Телефоны);
	// Смирнов М.Ю. 28.07.2025 HELP-6117 начало
	НаборПолей.Вставить("ЮрАдресОрганизации", ЕЕЭ.ЮридическийАдрес);
	// Смирнов М.Ю. 28.07.2025 HELP-6117 конец
	Возврат НаборПолей;
КонецФункции
//Кухарь А.Ю.  14.03.2025 конец

#КонецОбласти
